{
  "source": "Divan-e Shams-e Tabrizi (Divan-e Kabir)",
  "edition": "Based on Foruzanfar critical edition",
  "translation_method": "LLM (Omid Safi approach)",
  "translated_at": "2026-01-22T01:59:03.303039",
  "model": "mock",
  "translations": [
    {
      "number": 1,
      "meter": "Ramal",
      "rhyme": "-ān",
      "persian_text": [
        {
          "hemistich1": "بشنو از نی چون حکایت می‌کند",
          "hemistich2": "از جدایی‌ها شکایت می‌کند"
        },
        {
          "hemistich1": "کز نیستان تا مرا ببریده‌اند",
          "hemistich2": "در نفیرم مرد و زن نالیده‌اند"
        },
        {
          "hemistich1": "سینه خواهم شرحه شرحه از فراق",
          "hemistich2": "تا بگویم شرح درد اشتیاق"
        }
      ],
      "english_translation": "[Translation would appear here for Ghazal #1]\n\n---",
      "scholarly_notes": "This is a mock translation for demonstration purposes. In production, this would be generated by the Claude API with the full translation prompt.",
      "translator_model": "mock",
      "translated_at": "2026-01-22T01:59:03.302875",
      "confidence": "medium"
    },
    {
      "number": 911,
      "meter": "Hazaj",
      "rhyme": "-am",
      "persian_text": [
        {
          "hemistich1": "من چه دانم که چه مستم من چه دانم که چه هستم",
          "hemistich2": "دل بداده دل بداده دل به دلبر داده‌ام"
        },
        {
          "hemistich1": "گر مرا صد جان بودی جمله قربان کردمی",
          "hemistich2": "پیش آن قامت آن قامت چون سرو سهی"
        }
      ],
      "english_translation": "**Verse 1:**\nWhat do I know of what I am intoxicated with? What do I know of what I am?\nHeart given, heart given—I have given my heart to the heart-ravisher.\n\n**Verse 2:**\nIf I had a hundred souls, I would sacrifice them all,\nBefore that stature, that stature like a tall cypress.\n\n---",
      "scholarly_notes": "**Sufi Context:** This ghazal exemplifies the \"intoxicated\" (mast) style of Sufi poetry. The repeated \"what do I know\" (من چه دانم) expresses the dissolution of rational knowing in mystical experience.\n\n**Key Terms:**\n- \"Mast\" (مست): Spiritually intoxicated—drunk on divine presence, not literal wine. The tavern (meykhaneh) and wine (mey) are standard Sufi symbols for the heart and divine love.\n- \"Dilbar\" (دلبر): \"Heart-ravisher\"—one who steals hearts. Refers to both human beloved and divine Beloved.\n- \"Sarv\" (سرو): Cypress—a common Persian poetic image for the beloved's tall, graceful stature.\n\n**Ecstatic Dissolution:** The stammering repetition (\"heart given, heart given\"; \"that stature, that stature\") mimics the speech of one overwhelmed by spiritual experience—the rational faculties failing in the face of encounter with the divine.",
      "translator_model": "mock",
      "translated_at": "2026-01-22T01:59:03.302947",
      "confidence": "medium"
    },
    {
      "number": 462,
      "meter": "Ramal",
      "rhyme": "-ast",
      "persian_text": [
        {
          "hemistich1": "آن یکی می‌گفت دوشم کای فلان",
          "hemistich2": "شمس تبریزی چه نوری در جهان است"
        },
        {
          "hemistich1": "گفتمش خاموش کین دم را بدان",
          "hemistich2": "کاین سخن را هیچ پایان نیست"
        },
        {
          "hemistich1": "همچو ماهی بر فلک می‌تابد او",
          "hemistich2": "نور او در هر دلی که جان در آن است"
        }
      ],
      "english_translation": "**Verse 1:**\nSomeone said to me last night: \"O friend,\nWhat a light Shams-i Tabrizi is in this world!\"\n\n**Verse 2:**\nI said to him: \"Be silent! Know this moment—\nThis speech has no end.\"\n\n**Verse 3:**\nLike a moon he shines upon the heavens,\nHis light is in every heart where the soul resides.\n\n---",
      "scholarly_notes": "**Historical Context:** This ghazal directly names Shams al-Din Tabrizi (شمس تبریزی), the wandering mystic whose encounter with Rumi transformed the scholar into an ecstatic poet. \"Shams\" means \"sun\" in Arabic, and Rumi plays on this throughout—Shams is both the person and the spiritual sun.\n\n**Key Terms:**\n- \"Shams-i Tabrizi\": Rumi's spiritual beloved and teacher. The entire Divan-e Shams is nominally attributed to/dedicated to him.\n- The moon/sun imagery creates a paradox: Shams (Sun) shines \"like a moon\"—suggesting his light is both direct illumination and reflected divine light.\n\n**Sufi Relationship:** The relationship between Rumi and Shams exemplifies the murshid-murid (master-disciple) bond, though Rumi often positions Shams as the greater one. Their relationship scandalized conventional religious authorities of 13th-century Konya.",
      "translator_model": "mock",
      "translated_at": "2026-01-22T01:59:03.302970",
      "confidence": "medium"
    },
    {
      "number": 1173,
      "meter": "Hazaj",
      "rhyme": "-ū",
      "persian_text": [
        {
          "hemistich1": "عشق جان جمله جان‌هاست عشق مهر مهربان‌هاست",
          "hemistich2": "عشق است که نهان است عشق است که عیان است او"
        },
        {
          "hemistich1": "زین عشق شود هر دل چون آتش و چون آب",
          "hemistich2": "گه سوزد و گه سازد گه بخشد و گه بستاند او"
        },
        {
          "hemistich1": "در مذهب عاشق کفر و ایمان نباشد",
          "hemistich2": "او را نه تن است و نه جان چون عشق همه جان است او"
        }
      ],
      "english_translation": "**Verse 1:**\nLove is the soul of all souls, Love is the affection of all the affectionate,\nLove is that which is hidden, Love is that which is manifest—it is He.\n\n**Verse 2:**\nFrom this Love every heart becomes like fire and like water,\nSometimes it burns, sometimes it builds, sometimes it gives, sometimes it takes away—it is He.\n\n**Verse 3:**\nIn the religion of the lover there is neither disbelief nor faith,\nThe lover has neither body nor soul—for Love is all soul, it is He.\n\n---",
      "scholarly_notes": "**Sufi Context:** This ghazal meditates on 'ishq (عشق), divine love, as the animating force of existence. The repeated \"او\" (u/He) at the end of each couplet points to the divine—a common Sufi rhetorical device.\n\n**Key Terms:**\n- \"'Ishq\" (عشق): Not mere romantic love but the cosmic love that drives creation. In Sufi metaphysics, 'ishq is the force by which God desired to be known and thus created the world.\n- \"Kufr wa iman\" (کفر و ایمان): \"Disbelief and faith\"—Rumi suggests the lover transcends religious categories, not by abandoning Islam but by reaching a station where such distinctions dissolve in divine unity (tawhid).\n\n**Theological Nuance:** The line \"neither disbelief nor faith\" should not be read as religious relativism. Rather, it expresses the Sufi teaching that the realized mystic perceives only God—the categories of \"believer/disbeliever\" apply to the world of forms, not to one annihilated (fana) in divine presence.\n\n**Lost in Translation:** The Persian maintains a hypnotic rhythm through repetition that cannot be fully captured in English.",
      "translator_model": "mock",
      "translated_at": "2026-01-22T01:59:03.302996",
      "confidence": "medium"
    },
    {
      "number": 2114,
      "meter": "Khafif",
      "rhyme": "-ā",
      "persian_text": [
        {
          "hemistich1": "ای قوم به حج رفته کجایید کجایید",
          "hemistich2": "معشوق همین جاست بیایید بیایید"
        },
        {
          "hemistich1": "معشوق تو همسایه و دیوار به دیوار",
          "hemistich2": "در بادیه سرگشته شما در چه هوایید"
        },
        {
          "hemistich1": "گر صورت بی صورت معشوق ببینید",
          "hemistich2": "هم خواجه و هم خانه و هم کعبه شمایید"
        }
      ],
      "english_translation": "**Verse 1:**\nO people who have gone on Hajj—where are you, where are you?\nThe Beloved is right here—come, come!\n\n**Verse 2:**\nYour Beloved is your neighbor, wall to wall,\nYet you wander lost in the desert—what air do you seek?\n\n**Verse 3:**\nIf you behold the formless form of the Beloved,\nYou become the master, the house, and the Kaaba itself.\n\n---",
      "scholarly_notes": "**Sufi Context:** This ghazal addresses the tension between external religious practice (Hajj, pilgrimage to Mecca) and internal spiritual realization. Rumi does not dismiss Hajj but critiques those who seek the Divine only in external journeys while ignoring the Beloved's presence within.\n\n**Key Terms:**\n- \"Hajj\" (حج): The Islamic pilgrimage to Mecca, one of the Five Pillars of Islam. Rumi preserves this specifically Islamic reference.\n- \"The Beloved\" (معشوق): Deliberately ambiguous—refers to God, the divine presence, and potentially Shams-i Tabrizi.\n- \"Kaaba\" (کعبه): The sacred house in Mecca. In the final verse, Rumi suggests the realized mystic becomes the Kaaba—the heart becomes the true house of God.\n\n**Quranic Allusion:** The concept of God being closer than one's jugular vein (Quran 50:16) underlies the imagery of the Beloved as \"neighbor, wall to wall.\"\n\n**Lost in Translation:** The Persian \"در چه هوایید\" (dar che hava'id) contains wordplay—\"hava\" means both \"air/atmosphere\" and \"desire/whim,\" suggesting both physical wandering and scattered spiritual aspiration.",
      "translator_model": "mock",
      "translated_at": "2026-01-22T01:59:03.303018",
      "confidence": "medium"
    }
  ]
}